```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.api-gateway.google_api_gateway_api_config.main must be replaced
+/- resource "google_api_gateway_api_config" "main" {
      ~ api_config_id        = "terraform-20230803135047568500000001" -> (known after apply)
      + api_config_id_prefix = (known after apply)
      ~ display_name         = "terraform-20230803135047568500000001" -> (known after apply)
      ~ id                   = "projects/playground-1a136/locations/global/apis/playground-api/configs/terraform-20230803135047568500000001" -> (known after apply)
      - labels               = {} -> null
      ~ name                 = "projects/279861227938/locations/global/apis/playground-api/configs/terraform-20230803135047568500000001" -> (known after apply)
      ~ service_config_id    = "terraform-20230803135047568500000001-3nvr9o6r0h8pm" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ openapi_documents {
          ~ document {
              ~ path     = "openapi-v2.yml" -> "openapi_spec.yml" # forces replacement
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.api-gateway.google_api_gateway_gateway.main will be updated in-place
  ~ resource "google_api_gateway_gateway" "main" {
      ~ api_config       = "projects/279861227938/locations/global/apis/playground-api/configs/terraform-20230803135047568500000001" -> (known after apply)
        id               = "projects/playground-1a136/locations/europe-west1/gateways/playground-api-gateway"
        name             = "projects/playground-1a136/locations/europe-west1/gateways/playground-api-gateway"
        # (6 unchanged attributes hidden)
    }

  # module.github-repository.github_issue_label.main["Google Cloud"] will be destroyed
  # (because key ["Google Cloud"] is not in for_each map)
  - resource "github_issue_label" "main" {
      - color       = "3367d6" -> null
      - description = "Trigger deployment to Google Cloud" -> null
      - etag        = "W/\"5acc6ff29b33c293158d4ebade7f5c71a3dc99340d30da1058394ec54e8bdc03\"" -> null
      - id          = "playground.ashdavies.dev:Google Cloud" -> null
      - name        = "Google Cloud" -> null
      - repository  = "playground.ashdavies.dev" -> null
      - url         = "https://api.github.com/repos/ashdavies/playground.ashdavies.dev/labels/Google%20Cloud" -> null
    }

Plan: 1 to add, 1 to change, 2 to destroy.
```